/*
7-24 数组元素循环右移问题
分数 20
作者 DS课程组
单位 浙江大学
一个数组A中存有N（>0）个整数，在不允许使用另外数组的前提下，将每个整数循环向右移M（≥0）个位置，
如果需要考虑程序移动数据的次数尽量少，要如何设计移动的方法？

输入格式:
每个输入包含一个测试用例，第1行输入N（1≤N≤100）和M（≥0）；第2行输入N个整数，之间用空格分隔。

输出格式:
在一行中输出循环右移M位以后的整数序列，之间用空格分隔，序列结尾不能有多余空格。

注：
想象成圆环的顺时针与逆时针转，每次输出位置为i上的数
*/
#include <iostream>
using namespace std;

int main() {
    int n, m, a[100];
    cin >> n >> m;
    for (int i = 0; i < n; i++) cin >> a[i];

    m %= n;
    for (int i = 0; i < n; i++) {
        if (i) cout << " ";
        cout << a[(i - m + n) % n];
    }
    cout << endl;
    return 0;
}
